let mass = [
    {   
        name: 'Синкай сет',
        weight: '1 кг', 
        price: '23', 
        img: '../images/sets/sushi_5.jpeg',
        description: 'Ролл в лососе с огурцом и сливочным сыром, Ролл в опаленном сыре чеддер с креветкой, темпурой, соусом спайси и соусом барбекю, Ролл в сурими с тобико, мидиями, сливочным сыром, салатом айсберг, зеленым луком и кремом васаби'
    }, 
    {   
        name: 'Синкай сет',
        weight: '500 г', 
        price: '13', 
        img: '../images/sets/sushi_5.jpeg',
        description: 'Ролл в лососе с огурцом и сливочным сыром, Ролл в опаленном сыре чеддер с креветкой, темпурой, соусом спайси и соусом барбекю, Ролл в сурими с тобико, мидиями, сливочным сыром, салатом айсберг, зеленым луком и кремом васаби'
    }, 
    {   
        name: 'Синкай сет',
        weight: '200 г', 
        price: '7', 
        img: '../images/sets/sushi_5.jpeg',
        description: 'Ролл в лососе с огурцом и сливочным сыром, Ролл в опаленном сыре чеддер с креветкой, темпурой, соусом спайси и соусом барбекю, Ролл в сурими с тобико, мидиями, сливочным сыром, салатом айсберг, зеленым луком и кремом васаби'
    }, 
    {   
        name: 'Сет Клаб хаус',
        weight: '1,1 кг', 
        price: '22', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в миксе лосося, окуня и икры тобико со сливочным сыром и соусом терияки, ролл в опаленном беконе с лососем, жаренным в соусе терияки и сливочным сыром, ролл в сурими с копченым лососем, огурцом, сливочным сыром и соусом спайси, ролл в нори с копченым лососем, сливочным сыром, огурцом и соусом спайси, ролл в нори с лососем в соусе терияки, сливочным сыром, огурцом и соусом спайси'
    }, 
    {   
        name: 'Сет Клаб хаус',
        weight: '678 г', 
        price: '18', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в миксе лосося, окуня и икры тобико со сливочным сыром и соусом терияки, ролл в опаленном беконе с лососем, жаренным в соусе терияки и сливочным сыром, ролл в сурими с копченым лососем, огурцом, сливочным сыром и соусом спайси, ролл в нори с копченым лососем, сливочным сыром, огурцом и соусом спайси, ролл в нори с лососем в соусе терияки, сливочным сыром, огурцом и соусом спайси'
    }, 
    {   
        name: 'Сет Клаб хаус',
        weight: '478 г', 
        price: '17', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в миксе лосося, окуня и икры тобико со сливочным сыром и соусом терияки, ролл в опаленном беконе с лососем, жаренным в соусе терияки и сливочным сыром, ролл в сурими с копченым лососем, огурцом, сливочным сыром и соусом спайси, ролл в нори с копченым лососем, сливочным сыром, огурцом и соусом спайси, ролл в нори с лососем в соусе терияки, сливочным сыром, огурцом и соусом спайси'
    }, 
    {   
        name: 'Сет Клаб хаус',
        weight: '345 г', 
        price: '16', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в миксе лосося, окуня и икры тобико со сливочным сыром и соусом терияки, ролл в опаленном беконе с лососем, жаренным в соусе терияки и сливочным сыром, ролл в сурими с копченым лососем, огурцом, сливочным сыром и соусом спайси, ролл в нори с копченым лососем, сливочным сыром, огурцом и соусом спайси, ролл в нори с лососем в соусе терияки, сливочным сыром, огурцом и соусом спайси'
    }, 
    {   
        name: 'Радио Flash FM',
        weight: '600 г', 
        price: '17', 
        img: '../images/sets/sushi_1.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции). Ролл в лососе со сливочным сыром, авокадо и огурцом (1/2 порции). Ролл в икре летучей рыбы с авокадо, сурими, огурцом и майонезом. Ролл в хлопьях тунца с лососем, сливочным сыром и авокадо. Ролл в кунжуте с лососем, сливочным сыром, авокадо и огурцом. Ролл в креветке со сливочным сыром, огурцом и икрой летучей рыбы'
    }, 
    {   
        name: 'Радио Flash FM',
        weight: '500 г', 
        price: '14', 
        img: '../images/sets/sushi_1.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции). Ролл в лососе со сливочным сыром, авокадо и огурцом (1/2 порции). Ролл в икре летучей рыбы с авокадо, сурими, огурцом и майонезом. Ролл в хлопьях тунца с лососем, сливочным сыром и авокадо. Ролл в кунжуте с лососем, сливочным сыром, авокадо и огурцом. Ролл в креветке со сливочным сыром, огурцом и икрой летучей рыбы'
    }, 
    {   
        name: 'Радио Flash FM',
        weight: '400 г', 
        price: ' 12', 
        img: '../images/sets/sushi_1.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции). Ролл в лососе со сливочным сыром, авокадо и огурцом (1/2 порции). Ролл в икре летучей рыбы с авокадо, сурими, огурцом и майонезом. Ролл в хлопьях тунца с лососем, сливочным сыром и авокадо. Ролл в кунжуте с лососем, сливочным сыром, авокадо и огурцом. Ролл в креветке со сливочным сыром, огурцом и икрой летучей рыбы'
    }, 
];

for (let i = 0; i < mass.length; i++) {
    document.write(`<div class="set">`);
        document.write(`<div class="set_info">`);
            document.write(`<span class="set_name">${mass[i].name} </span>`);
            document.write(`<span class="set_weight">${mass[i].weight}</span>`);
            document.write(`<span class="set_price">${mass[i].price} б.р.</span>`);
            document.write(`<div class="description">`);
                document.write(`<span>${mass[i].description}</span>`)
            document.write(`</div>`);
        document.write(`</div>`);
        document.write(`<img src="${mass[i].img}">`);
        document.write(`<button>Купить</button>`);
    document.write(`</div>`);
}


                
                
                
               
            