let mass = [
    {   
        name: 'Ультра суши',
        weight: '', 
        price: '', 
        img: '../images/sets/sushi_1.jpeg',
        description: 'Ролл в лососе с огурцом и сливочным сыром, ролл в тунце, лососе и морском окуне со сливочным сыром, ролл в икре летучей рыбы с авокадо, креветкой, огурцом и майонезом, ролл в кунжуте с лососем, сливочным сыром, авокадо и огурцом (26 шт.)'
    }, 
    {   
        name: 'Ультра суши',
        weight: '300 г', 
        price: '10', 
        img: '../images/sets/sushi_1.jpeg',
        description: 'Ролл в лососе с огурцом и сливочным сыром, ролл в тунце, лососе и морском окуне со сливочным сыром, ролл в икре летучей рыбы с авокадо, креветкой, огурцом и майонезом, ролл в кунжуте с лососем, сливочным сыром, авокадо и огурцом (10 шт.)'
    }, 
    {   
        name: 'Сет Санта-Барбара', 
        weight: '1 кг', 
        price: '30', 
        img: '../images/sets/sushi_2.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Санта-Барбара', 
        weight: '600 г', 
        price: '20', 
        img: '../images/sets/sushi_2.jpeg',
        description: 'ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/4 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Санта-Барбара', 
        weight: '600 г', 
        price: '20', 
        img: '../images/sets/sushi_2.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/4 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/4 порции),  и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Санта-Барбара', 
        weight: '300 г', 
        price: '10', 
        img: '../images/sets/sushi_2.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/8 порции), ролл в стружке тунца с лососем, ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Дыхание дракона', 
        weight: '1,3 кг', 
        price: '23', 
        img: '../images/sets/sushi_3.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Дыхание дракона', 
        weight: '900 г', 
        price: '13', 
        img: '../images/sets/sushi_3.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Дыхание дракона', 
        weight: '300 г', 
        price: '8', 
        img: '../images/sets/sushi_3.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Большой', 
        weight: '2,6 кг', 
        price: '78', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Большой', 
        weight: '1,6 кг', 
        price: '40', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
    {   
        name: 'Сет Большой', 
        weight: '1 кг', 
        price: '36', 
        img: '../images/sets/sushi_4.jpeg',
        description: 'Ролл в лососе со сливочным сыром (1/2 порции), ролл в стружке тунца с лососем, авокадо и сливочным сыром (1/2 порции), ролл в морских водорослях с лососем, сливочным сыром и ореховым соусом (1/2 порции), ролл в креветке со сливочным сыром (1/2 порции), ролл в лососе с авокадо, огурцом и сливочным сыром (1/2 порции), ролл в тобико с лососем, креветкой, авокадо и сливочным сыром (1/2 порции), ролл в копченом лососе с креветкой в темпуре, манго, сливочным сыром и соусом спайси (1/2 порции), ролл в кунжуте с лососем, авокадо, огурцом и сливочным сыром (1/2 порции), ролл с морским сомом, японским омлетом, грибами, соусом спайси, такуаном, сливочным сыром и соусом терияки'
    }, 
];

for (let i = 0; i < mass.length; i++) {
    document.write(`<div class="set">`);
        document.write(`<div class="set_info">`);
            document.write(`<span class="set_name">${mass[i].name} </span>`);
            document.write(`<span class="set_weight">${mass[i].weight}</span>`);
            document.write(`<span class="set_price">${mass[i].price} б.р.</span>`);
            document.write(`<div class="description">`);
                document.write(`<span>${mass[i].description}</span>`)
            document.write(`</div>`);
        document.write(`</div>`);
        document.write(`<img src="${mass[i].img}">`);
        document.write(`<button>Купить</button>`);
    document.write(`</div>`);
}


                
                
                
               
            